afonsorcarvalho/esp32-Fitadigital/lib/WireGuard-ESP32/src/wireguardif.c
		// See if the peer is already registered
		peer = peer_lookup_by_pubkey(device, public_key);
		if (!peer) {
			// Not active - see if we have room to allocate a new one
			peer = peer_alloc(device);
			if (peer) {

				if (wireguard_peer_init(device, peer, public_key, p->preshared_key == NULL ? NULL : preshared_key)) {

					peer->connect_ip = p->endpoint_ip;
					peer->connect_port = p->endport_port;
					peer->ip = peer->connect_ip;
					peer->port = peer->connect_port;
					if (p->keep_alive == WIREGUARDIF_KEEPALIVE_DEFAULT) {
						peer->keepalive_interval = KEEPALIVE_TIMEOUT;
					} else {
						peer->keepalive_interval = p->keep_alive;
					}
					peer_add_ip(peer, p->allowed_ip, p->allowed_mask);
					memcpy(peer->greatest_timestamp, p->greatest_timestamp, sizeof(peer->greatest_timestamp));

					result = ERR_OK;
				} else {
					result = ERR_ARG;
				}
			} else {
				result = ERR_MEM;
			}
		} else {
			result = ERR_OK;
		}
	} else {
		result = ERR_ARG;
	}

	uint32_t t2 = wireguard_sys_now();
	log_i(TAG "Adding peer took %ums\r\n", (t2-t1));

	if (peer_index) {
		if (peer) {
			*peer_index = wireguard_peer_index(device, peer);
		} else {
			*peer_index = WIREGUARDIF_INVALID_INDEX;
		}
	}

	free(preshared_key);
	free(public_key);

	return result;
}

static bool should_send_initiation(struct wireguard_peer *peer) {
	bool result = false;
	if (wireguardif_can_send_initiation(peer)) {
		if (peer->send_handshake) {
			result = true;
		} else if (peer->curr_keypair.valid && !peer->curr_keypair.initiator && wireguard_expired(peer->curr_keypair.keypair_millis, REJECT_AFTER_TIME - peer->keepalive_interval)) {
			result = true;
		} else if (!peer->curr_keypair.valid && peer->active) {
			result = true;
		}
	}
	return result;
}

static bool should_send_keepalive(struct wireguard_peer *peer) {
	bool result = false;
	if (peer->keepalive_interval > 0) {
		if ((peer->curr_keypair.valid) || (peer->prev_keypair.valid)) {
			if (wireguard_expired(peer->last_tx, peer->keepalive_interval)) {
				result = true;
			}
		}
	}
	return result;
}

static bool should_destroy_current_keypair(struct wireguard_peer *peer) {
	bool result = false;
	if (peer->curr_keypair.valid &&
			(wireguard_expired(peer->curr_keypair.keypair_millis, REJECT_AFTER_TIME) ||
			(peer->curr_keypair.sending_counter >= REJECT_AFTER_MESSAGES))
		) {
		result = true;
	}
	return result;
}

static bool should_reset_peer(struct wireguard_peer *peer) {
	bool result = false;
	if (peer->curr_keypair.valid && (wireguard_expired(peer->curr_keypair.keypair_millis, REJECT_AFTER_TIME * 3))) {
		result = true;
	}
	return result;
}

static void wireguardif_tmr(void *arg) {
	struct wireguard_device *device = (struct wireguard_device *)arg;
	struct wireguard_peer *peer;
	int x;
	// Reschedule this timer
	sys_timeout(WIREGUARDIF_TIMER_MSECS, wireguardif_tmr, device);

	// Check periodic things
	bool link_up = false;
	for (x=0; x < WIREGUARD_MAX_PEERS; x++) {
		peer = &device->peers[x];
		if (peer->valid) {
			// Do we need to rekey / send a handshake?
			if (should_reset_peer(peer)) {
				// Nothing back for too long - we should wipe out all crypto state
				keypair_destroy(&peer->next_keypair);
				keypair_destroy(&peer->curr_keypair);
				keypair_destroy(&peer->prev_keypair);
				handshake_destroy(&peer->handshake);

				// Revert back to default IP/port if these were altered
				peer->ip = peer->connect_ip;
				peer->port = peer->connect_port;
			}
			if (should_destroy_current_keypair(peer)) {
				// Destroy current keypair
				keypair_destroy(&peer->curr_keypair);
			}
			if (should_send_keepalive(peer)) {
				wireguardif_send_keepalive(device, peer);
			}
			if (should_send_initiation(peer)) {
				wireguard_start_handshake(device->netif, peer);
			}

			if ((peer->curr_keypair.valid) || (peer->prev_keypair.valid)) {
				link_up = true;
			}

			if (device->update_peer_info_fn != NULL) {
				uint8_t peer_idx = wireguard_peer_index(device, peer);
				bool up = peer->curr_keypair.valid;
				struct wireguard_peer_info *info = &device->peer_infos[peer_idx];

				if (info->up != up || memcmp(&info->addr, &peer->ip, sizeof(info->addr)) != 0 || info->port != peer->port) {
					info->up = up;
					info->addr = peer->ip;
					info->port = peer->port;
					device->update_peer_info_fn(peer_idx, info->up, &info->addr, info->port, device->update_peer_info_fn_user_data);
				}
			}
		}
	}

	if (!link_up) {
		// Clear the IF-UP flag on netif
		netif_set_link_down(device->netif);
	}
}

void wireguardif_shutdown(struct netif *netif) {
	LWIP_ASSERT("netif != NULL", (netif != NULL));

	struct wireguard_device * device = (struct wireguard_device *) netif_get_client_data(netif, wg_netif_client_id);
	LWIP_ASSERT("device != NULL", (device != NULL));
	// Disable timer.
	sys_untimeout(wireguardif_tmr, device);
	// remove UDP context.
	if( device->udp_pcb ) {
		udp_disconnect(device->udp_pcb);
		udp_remove(device->udp_pcb);
		device->udp_pcb = NULL;
	}
	// remove device context.
	free(device);
	netif_set_client_data(netif, wg_netif_client_id, NULL);
	netif->state = NULL;
}

err_t wireguardif_init(struct netif *netif) {
	err_t result;
	struct wireguardif_init_data *init_data;
	struct wireguard_device *device;
	struct udp_pcb *udp;
	uint8_t *private_key = malloc(WIREGUARD_PRIVATE_KEY_LEN);
	size_t private_key_len = WIREGUARD_PRIVATE_KEY_LEN;

	struct netif* underlying_netif;
	underlying_netif = netif_default;	// Use current netif as the underlying netif of the WireGuard interface.
	log_i(TAG "underlying_netif = %p", underlying_netif);

	LWIP_ASSERT("netif != NULL", (netif != NULL));
	LWIP_ASSERT("state != NULL", (netif->state != NULL));

	// We need to initialise the wireguard module
	wireguard_init();
	log_i(TAG "wireguard module initialized.");

	if (!netif || !netif->state) {
		log_e(TAG "netif or state is NULL: netif=%p, netif.state:%p", netif, netif ? netif->state : NULL);
		result = ERR_ARG;
		goto cleanup_private_key;
	}

	// The init data is passed into the netif_add call as the 'state' - we will replace this with our private state data
	init_data = (struct wireguardif_init_data *)netif->state;

	// Clear out and set if function is successful
	netif->state = NULL;

	if (!wireguard_base64_decode(init_data->private_key, private_key, &private_key_len)
			|| (private_key_len != WIREGUARD_PRIVATE_KEY_LEN)) {
		log_e(TAG "invalid init_data private key");
		result = ERR_ARG;
		goto cleanup_private_key;
	}

