afonsorcarvalho/esp32-Fitadigital/lib/WireGuard-ESP32/src/wireguardif.c
	udp = udp_new();

	if (!udp) {
		log_e(TAG "failed to allocate UDP");
		result = ERR_MEM;
		goto cleanup_private_key;
	}

	result = udp_bind(udp, IP_ADDR_ANY, init_data->listen_port); // Note this listens on all interfaces! Really just want the passed netif
	if (result != ERR_OK) {
		log_e(TAG "failed to bind UDP err=%d", result);
		goto cleanup_udp;
	}

	device = (struct wireguard_device *)mem_calloc(1, sizeof(struct wireguard_device));
	if (!device) {
		log_e(TAG "failed to allocate device context.");
		result = ERR_MEM;
		goto cleanup_udp;
	}

	device->netif = netif;
	device->underlying_netif = underlying_netif;
	//udp_bind_netif(udp, underlying_netif);

	device->udp_pcb = udp;
	device->in_filter_fn = init_data->in_filter_fn;
	device->out_filter_fn = init_data->out_filter_fn;
	device->update_peer_info_fn = init_data->update_peer_info_fn;
	device->update_peer_info_fn_user_data = init_data->update_peer_info_fn_user_data;
	log_d(TAG "start device initialization");
	// Per-wireguard netif/device setup
	uint32_t t1 = wireguard_sys_now();
	if (!wireguard_device_init(device, private_key)) {
		log_e(TAG "failed to initialize WireGuard device.");
		result = ERR_ARG;
		goto cleanup_device;
	}

	uint32_t t2 = wireguard_sys_now();
	log_d(TAG "Device init took %ums\r\n", (t2-t1));

#if LWIP_CHECKSUM_CTRL_PER_NETIF
	NETIF_SET_CHECKSUM_CTRL(netif, NETIF_CHECKSUM_ENABLE_ALL);
#endif
	netif_set_client_data(netif, wg_netif_client_id, device);
	netif->name[0] = 'w';
	netif->name[1] = 'g';
	netif->output = wireguardif_output;
	netif->linkoutput = NULL;
	netif->hwaddr_len = 0;
	netif->mtu = (init_data->mtu > 0) ? init_data->mtu : WIREGUARDIF_MTU;
	// We set up no state flags here - caller should set them
	// NETIF_FLAG_LINK_UP is automatically set/cleared when at least one peer is connected
	netif->flags = 0;

	udp_recv(udp, wireguardif_network_rx, device);

	// Start a periodic timer for this wireguard device
	sys_timeout(WIREGUARDIF_TIMER_MSECS, wireguardif_tmr, device);

	result = ERR_OK;
	goto cleanup_private_key;

cleanup_device:
	mem_free(device);
	device = NULL;

cleanup_udp:
	udp_remove(udp);

cleanup_private_key:
	free(private_key);
	return result;
}

void wireguardif_peer_init(struct wireguardif_peer *peer) {
	LWIP_ASSERT("peer != NULL", (peer != NULL));
	memset(peer, 0, sizeof(struct wireguardif_peer));
	// Caller must provide 'public_key'
	peer->public_key = NULL;
	ip_addr_set_any(false, &peer->endpoint_ip);
	peer->endport_port = WIREGUARDIF_DEFAULT_PORT;
	peer->keep_alive = WIREGUARDIF_KEEPALIVE_DEFAULT;
	ip_addr_set_any(false, &peer->allowed_ip);
	ip_addr_set_any(false, &peer->allowed_mask);
	memset(peer->greatest_timestamp, 0, sizeof(peer->greatest_timestamp));
	peer->preshared_key = NULL;
}
